tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "nikitabobko/tap"
brew "xz"
brew "armadillo"
brew "automake"
brew "b2sum"
brew "bash-completion"
brew "bat"
brew "bear"
brew "boost"
brew "btop"
brew "readline"
brew "sqlite"
brew "python@3.13"
brew "cava"
brew "llvm"
brew "ccls"
brew "cdrtools"
brew "curl"
brew "docker"
brew "libyaml"
brew "dooit"
brew "dos2unix"
brew "dust"
brew "duti"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "libarchive"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "flow"
brew "freetds"
brew "fzf"
brew "ggshield"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "gnu-typist"
brew "lua"
brew "gnuplot"
brew "go"
brew "gotop"
brew "gsl"
brew "handbrake"
brew "pkgconf"
brew "hdf5"
brew "helix"
brew "htop"
brew "ifstat"
brew "libomp"
brew "imagemagick"
brew "jq"
brew "utf8proc", args: ["HEAD"]
brew "julia"
brew "lazygit"
brew "librsvg"
brew "luarocks"
brew "mas"
brew "openjdk"
brew "maven"
brew "micro"
brew "ncspot"
brew "neovim"
brew "nnn"
brew "node"
brew "nowplaying-cli"
brew "ocrmypdf"
brew "ollama"
brew "pandoc"
brew "parallel"
brew "php", restart_service: :changed
brew "pipx"
brew "pnpm"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "powerlevel10k"
brew "pytest"
brew "python@3.12"
brew "qemu"
brew "rbenv"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "scipy"
brew "smartmontools"
brew "spicetify-cli"
brew "sqlcmd"
brew "ssh-copy-id"
brew "starship"
brew "switchaudio-osx"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "todo-txt"
brew "topgrade"
brew "tree"
brew "tt"
brew "uv"
brew "wget"
brew "wireguard-go"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
cask "balenaetcher"
cask "calibre"
cask "discord"
cask "font-inconsolata"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gstreamer-runtime"
cask "istat-menus"
cask "itsycal"
cask "neovide"
cask "netbeans"
cask "pearcleaner"
cask "quarto"
cask "reaper"
cask "sf-symbols"
cask "stats"
cask "the-unarchiver"
cask "utm"
cask "vmware-fusion"
cask "whisky"
cask "wine-stable"
cask "zed"
cask "zen-browser@twilight"
mas "Connective Plugin", id: 1428740565
mas "Flow", id: 1423210932
mas "ipTV", id: 1525121231
mas "IPTV Expert", id: 1641944027
mas "Kindle", id: 302584613
mas "Unsplash Wallpapers", id: 1284863847
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "microprofile-community.mp-rest-client-generator-vscode-ext"
vscode "microprofile-community.mp-starter-vscode-ext"
vscode "microprofile-community.vscode-microprofile-pack"
vscode "moocfi.test-my-code"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "quarto.quarto"
vscode "redhat.java"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-quarkus"
vscode "sonarsource.sonarlint-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
