tap "apple/apple"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "gcenx/apple"
tap "gcenx/wine"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "nikitabobko/tap"
brew "xz"
brew "automake"
brew "libyaml"
brew "readline"
brew "sqlite"
brew "python@3.12"
brew "azure-cli"
brew "bat"
brew "bottom"
brew "broot"
brew "btop"
brew "cairo"
brew "curl"
brew "docker"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "libarchive"
brew "python@3.13"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "go"
brew "libomp"
brew "imagemagick"
brew "utf8proc", args: ["HEAD"]
brew "julia"
brew "lazygit"
brew "llvm"
brew "lua"
brew "luarocks"
brew "mas"
brew "openjdk"
brew "maven"
brew "minikube"
brew "neovim", args: ["HEAD"]
brew "neovide"
brew "nmap"
brew "node"
brew "ocrmypdf"
brew "pandoc"
brew "pipx"
brew "pnpm"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "sqlcmd"
brew "tailscale", restart_service: :changed
brew "tectonic"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "anaconda"
cask "balenaetcher"
cask "calibre"
cask "cursor"
cask "db-browser-for-sqlite"
cask "discord"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "istat-menus"
cask "itsycal"
cask "latest"
cask "neovide"
cask "pearcleaner"
cask "plex"
cask "plex-media-server"
cask "protonvpn"
cask "royal-tsx"
cask "sf-symbols"
cask "the-unarchiver"
cask "zed"
mas "Connective Plugin", id: 1428740565
mas "Flow", id: 1423210932
mas "IPTV Expert", id: 1641944027
mas "Unsplash Wallpapers", id: 1284863847
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "astro-build.astro-vscode"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codeium.codeium"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sidthesloth.html5-boilerplate"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
