tap "apple/apple"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "gcenx/apple"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "nikitabobko/tap"
brew "xz"
brew "automake"
brew "libyaml"
brew "readline"
brew "sqlite"
brew "python@3.12"
brew "azure-cli"
brew "bat"
brew "bottom"
brew "broot"
brew "btop"
brew "cairo"
brew "curl"
brew "docker"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "libarchive"
brew "python@3.13"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "go"
brew "libomp"
brew "imagemagick"
brew "utf8proc", args: ["HEAD"]
brew "julia"
brew "lazygit"
brew "llvm"
brew "lua"
brew "luarocks"
brew "mas"
brew "openjdk"
brew "maven"
brew "minikube"
brew "neovim"
brew "neovide"
brew "nmap"
brew "node"
brew "ocrmypdf"
brew "pandoc"
brew "pnpm"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "sqlcmd"
brew "tectonic"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "balenaetcher"
cask "calibre"
cask "db-browser-for-sqlite"
cask "discord"
cask "font-symbols-only-nerd-font"
cask "game-porting-toolkit"
cask "ghostty"
cask "istat-menus"
cask "itsycal"
cask "latest"
cask "neovide"
cask "pearcleaner"
cask "plex"
cask "plex-media-server"
cask "royal-tsx"
cask "sf-symbols"
cask "the-unarchiver"
cask "vmware-fusion"
cask "whisky"
cask "zed"
mas "Connective Plugin", id: 1428740565
mas "Flow", id: 1423210932
mas "ipTV", id: 1525121231
mas "IPTV Expert", id: 1641944027
mas "Unsplash Wallpapers", id: 1284863847
mas "Windows App", id: 1295203466
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "arzg.intellij-theme"
vscode "avetis.tokyo-night"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "djsaunders1997.uv-wingman"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "mechatroner.rainbow-csv"
vscode "microprofile-community.mp-rest-client-generator-vscode-ext"
vscode "microprofile-community.mp-starter-vscode-ext"
vscode "microprofile-community.vscode-microprofile-pack"
vscode "moocfi.test-my-code"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "quarto.quarto"
vscode "redhat.java"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
