# Brewfile — desired-state package manifest for macOS
# Install everything: brew bundle --file=~/.config/Brewfile
# Refresh from a machine: brew bundle dump --file=- --describe
#
# Note: this is a *superset* desired-state file. Some entries may not be
# installed on every machine (fonts installed manually, App Store apps, etc.);
# brew bundle will install them on a fresh machine for parity.

tap "apple/apple"
tap "devenjarvis/tap"
tap "felixkratz/formulae"
tap "gcenx/apple"
tap "gcenx/wine"
tap "minghinmatthewlam/tap"
tap "nikitabobko/tap"
tap "qlik-oss/taps"
tap "stablyai/orca"
tap "steipete/tap"

# --- Formulae -------------------------------------------------------------
brew "age"
brew "atuin", restart_service: :changed
brew "automake"
brew "autossh"
brew "bash"
brew "bat"
brew "bats-core"
brew "blueutil"
brew "bottom"
brew "broot"
brew "btop"
brew "cloudflared"
brew "cmake"
brew "curl"
brew "docker"
brew "dotnet"
brew "dotter"
brew "duf"
brew "dust"
brew "exercism"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fio"
brew "fish"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-secrets"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gum"
brew "hf"
brew "hledger"
brew "htop"
brew "huggingface-cli"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "julia"
brew "just"
brew "kubernetes-cli"
brew "lazygit"
brew "ledger"
brew "llama.cpp"
brew "llvm"
brew "lua"
brew "luarocks"
brew "m-cli"
brew "macmon"
brew "mactop"
brew "marp-cli"
brew "mas"
brew "mise"
brew "minikube"
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "nnn"
brew "node"
brew "node@22"
brew "node@24"
brew "nowplaying-cli"
brew "ocrmypdf"
brew "opencode"
brew "openjdk"
brew "pandoc"
brew "php", restart_service: :changed
brew "php@8.3"
brew "pi-coding-agent"
brew "pipx"
brew "pnpm"
brew "poppler"
brew "procs"
brew "python@3.12"
brew "python@3.13"
brew "qemu"
brew "rclone"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "sops"
brew "sqlcmd"
brew "starship"
brew "switchaudio-osx"
brew "tailscale", restart_service: :changed
brew "tectonic"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "typst"
brew "uv"
brew "viddy"
brew "wget"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "felixkratz/formulae/borders"

# --- Casks ----------------------------------------------------------------
cask "aerospace"
cask "alfred"
cask "antigravity"
cask "beid-token"
cask "beid-viewer"
cask "claude"
cask "claude-code"
cask "cloudflare-warp"
cask "codex"
cask "codex-app"
cask "codexbar"
cask "discord"
cask "dotnet-sdk"
cask "eid-viewer"
cask "fluidvoice"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "itsycal"
cask "jellyfin-media-player"
cask "lathe"
cask "llamabarn"
cask "logi-options+"
cask "obs"
cask "obsidian"
cask "pearcleaner"
cask "quarto"
cask "sf-symbols"
cask "spotify"
cask "steam"
cask "tailscale-app"
cask "the-unarchiver"
cask "transmission"
cask "whatsapp"
cask "wispr-flow"
cask "zed"

# --- Mac App Store (requires `mas` + being signed into the App Store) ------
mas "Connective Plugin", id: 1428740565
mas "Flow", id: 1423210932
mas "IPTV Expert", id: 1641944027
