tap "apple/apple"
tap "d12frosted/emacs-plus"
tap "devenjarvis/tap"
tap "felixkratz/formulae"
tap "gcenx/apple"
tap "gcenx/wine"
tap "minghinmatthewlam/tap"
tap "nikitabobko/tap"
tap "qlik-oss/taps"
tap "stablyai/orca"
tap "steipete/tap"
brew "atuin", restart_service: :changed
brew "autossh"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bottom"
brew "broot"
brew "btop"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "docker"
brew "dotnet"
brew "dotter"
brew "duf"
brew "dust"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fio"
brew "fish"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-secrets"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gum"
brew "htop"
brew "huggingface-cli"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "julia"
brew "just"
brew "kubernetes-cli"
brew "lazygit"
brew "ledger"
brew "llama.cpp"
brew "llvm"
brew "lua"
brew "luarocks"
brew "macmon"
brew "mactop"
brew "marp-cli"
brew "mas"
brew "mise"
brew "minikube"
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "nnn"
brew "node"
brew "node@22"
brew "node@24"
brew "nowplaying-cli"
brew "ocrmypdf"
brew "opencode"
brew "pandoc"
brew "php", restart_service: :changed
brew "php@8.3"
brew "pi-coding-agent"
brew "pipx"
brew "pnpm"
brew "procs"
brew "python@3.12"
brew "python@3.13"
brew "qemu"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sqlcmd"
brew "starship"
brew "switchaudio-osx"
brew "tailscale", restart_service: :changed
brew "tectonic"
brew "thefuck"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "typst"
brew "uv"
brew "viddy"
brew "wget"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
cask "aerospace"
cask "antigravity"
cask "beid-token"
cask "beid-viewer"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "codexbar"
cask "discord"
cask "dotnet-sdk"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "itsycal"
cask "jellyfin-media-player"
cask "lathe"
cask "llamabarn"
cask "logi-options+"
cask "obs"
cask "obsidian"
cask "pearcleaner"
cask "quarto"
cask "sf-symbols"
cask "spotify"
cask "steam"
cask "tailscale-app"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "whatsapp"
cask "wispr-flow"
cask "zed"
mas "Connective Plugin", id: 1428740565
mas "Flow", id: 1423210932
mas "IPTV Expert", id: 1641944027
vscode "astro-build.astro-vscode"
vscode "be5invis.toml"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codescene.codescene-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbcode.dbcode"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "hendarion.hexstringpreview"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ionide.ionide-fsharp"
vscode "itisnajim.dart-color-switcher"
vscode "kevinrose.vsc-python-indent"
vscode "lkrms.inifmt"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "myzel394.config-lsp"
vscode "openai.chatgpt"
vscode "piousdeer.adwaita-theme"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yinfei.luahelper"
