tap "apple/apple"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "gcenx/apple"
tap "gcenx/wine"
tap "nikitabobko/tap"
tap "railwaycat/emacsmacport"
brew "xz"
brew "atuin", restart_service: :changed
brew "automake"
brew "libyaml"
brew "readline"
brew "sqlite"
brew "python@3.13"
brew "azure-cli"
brew "bash"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "bottom"
brew "broot"
brew "btop"
brew "cairo"
brew "chezmoi"
brew "curl"
brew "docker"
brew "dotnet"
brew "duf"
brew "dust"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "libarchive"
brew "tesseract"
brew "ffmpeg"
brew "fio"
brew "flyctl"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-crypt"
brew "git-filter-repo"
brew "git-lfs"
brew "git-secrets"
brew "glow"
brew "gnu-typist"
brew "go"
brew "gum"
brew "htop"
brew "libomp"
brew "imagemagick"
brew "jq"
brew "utf8proc", args: ["HEAD"]
brew "julia"
brew "lazygit"
brew "llvm"
brew "lua"
brew "luarocks"
brew "m-cli"
brew "mas"
brew "openjdk"
brew "maven"
brew "minikube"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "nnn"
brew "node"
brew "nowplaying-cli"
brew "ocrmypdf"
brew "pandoc"
brew "php", restart_service: :changed
brew "php@8.3"
brew "pipx"
brew "pnpm"
brew "python@3.12"
brew "qemu"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "sqlcmd"
brew "starship"
brew "switchaudio-osx"
brew "tailscale", restart_service: :changed
brew "tectonic"
brew "thefuck"
brew "tree"
brew "typst"
brew "uv"
brew "viddy"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "railwaycat/emacsmacport/emacs-mac@29"
cask "aerospace"
cask "anaconda"
cask "audacity"
cask "balenaetcher"
cask "beid-token"
cask "calibre"
cask "chatgpt"
cask "claude-code"
cask "cursor"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker-desktop"
cask "dotnet-sdk@8"
cask "dropbox"
cask "eid-viewer"
cask "figma"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "herd"
cask "iina"
cask "iptvnator"
cask "itsycal"
cask "jetbrains-toolbox"
cask "latest"
cask "localsend"
cask "logi-options+"
cask "macdown"
cask "obs"
cask "obsidian"
cask "pearcleaner"
cask "royal-tsx"
cask "sf-symbols"
cask "smoothcsv"
cask "spotify"
cask "steam"
cask "tailscale-app"
cask "termius"
cask "the-unarchiver"
cask "utm"
cask "visual-paradigm-ce"
cask "visual-studio-code"
cask "whatsapp"
cask "zed"
mas "Connective Plugin", id: 1428740565
mas "Flow", id: 1423210932
mas "IPTV Expert", id: 1641944027
vscode "astro-build.astro-vscode"
vscode "be5invis.toml"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codescene.codescene-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbcode.dbcode"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hendarion.hexstringpreview"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ionide.ionide-fsharp"
vscode "itisnajim.dart-color-switcher"
vscode "kevinrose.vsc-python-indent"
vscode "lkrms.inifmt"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "myzel394.config-lsp"
vscode "openai.chatgpt"
vscode "piousdeer.adwaita-theme"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yinfei.luahelper"
